
// Задача 1
Console.Write("Input number ");
int number = Convert.ToInt32(Console.ReadLine());

int kvadrat = number * number;
Console.WriteLine($"The quad of {number} is {kvadrat}");


// Задача 2:
/*
Напишите программу, которая на вход принимает два числа и проверяет,
является ли первое число квадратом второго.
*/

